Documents/питРецептура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>питРецептура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.питХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерРецептуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ингредиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковокБрутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковокНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковокВыход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоВыход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Рецептура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.питРецептура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Замена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗапретитьЗамены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоБрутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазрешенныеПодразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЦеховаяКладовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВключаяПодчиненные</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/питХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>питХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыпускПродукцииСПеремещением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыпускПродукцииСРеализацией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыпускПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыпускПродукцииСРозничнойРеализацией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыпускПродукцииСоСписанием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РецептураРазделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РецептураПриготовление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/питРецептура/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.питАктПроработки") Тогда
		
		Наименование				= Основание.Наименование;
		ХозяйственнаяОперация		= Перечисления.питХозяйственныеОперации.РецептураПриготовление;
		Организация					= Основание.Организация;
		Ответственный				= Основание.Ответственный;
		Комментарий					= Основание.Комментарий;
		Подразделение				= Основание.Подразделение;
		Номенклатура				= Основание.Номенклатура;
		Характеристика				= Основание.Характеристика;
		Количество					= Основание.Количество;
		КоличествоУпаковок			= Основание.КоличествоУпаковок;
		Упаковка					= Основание.Упаковка;
		НомерРецептуры				= Основание.НомерРецептуры;
		Выход						= Основание.Выход;
		ТехнологияПриготовления		= Основание.ТехнологияПриготовления;
		ДатаНачала					= Основание.ДатаНачала;
		ДатаКонца					= Основание.ДатаКонца;
		ДокументОснование			= Основание;
		СтатьяКалькуляци			= питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("СтатьяКалькуляцииПоУмолчанию");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Основание);
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктПроработкиТовары.Номенклатура,
		|	АктПроработкиТовары.Характеристика,
		|	АктПроработкиТовары.Упаковка,
		|	ВЫРАЗИТЬ((АктПроработкиТовары.КоличествоУпаковокБрутто + АктПроработкиТовары.КоличествоУпаковокБрутто1 + АктПроработкиТовары.КоличествоУпаковокБрутто2)/3 КАК ЧИСЛО(15,3))КАК КоличествоУпаковокБрутто,
		|	ВЫРАЗИТЬ((АктПроработкиТовары.КоличествоУпаковокНетто + АктПроработкиТовары.КоличествоУпаковокНетто1 + АктПроработкиТовары.КоличествоУпаковокНетто2)/3 КАК ЧИСЛО(15,3)) КАК КоличествоУпаковокНетто,
		|	ВЫРАЗИТЬ((АктПроработкиТовары.КоличествоУпаковокВыход + АктПроработкиТовары.КоличествоУпаковокВыход1 + АктПроработкиТовары.КоличествоУпаковокВыход2)/3 КАК ЧИСЛО(15,3)) КАК КоличествоУпаковокВыход
		|ИЗ
		|	Документ.питАктПроработки.Ингредиенты КАК АктПроработкиТовары
		|ГДЕ
		|	АктПроработкиТовары.Ссылка = &Ссылка";
		
		Ингредиенты.Загрузить(Запрос.Выполнить().Выгрузить());
		
		КэшированныеЗначенияУпаковок = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
		// Заполним проценты потерь
		Для Каждого СтрокаТовары Из Ингредиенты Цикл
			Если НЕ СтрокаТовары.КоличествоУпаковокБрутто = СтрокаТовары.КоличествоУпаковокНетто Тогда
				СтрокаТовары.ПроцентПотерьПриХолоднойОбработке = РассчитатьПроцентПотерьОбработки(СтрокаТовары.КоличествоУпаковокБрутто, СтрокаТовары.КоличествоУпаковокНетто);
			КонецЕсли;
			Если НЕ СтрокаТовары.КоличествоУпаковокНетто = СтрокаТовары.КоличествоУпаковокВыход Тогда
				СтрокаТовары.ПроцентПотерьПриГорячейОбработке = РассчитатьПроцентПотерьОбработки(СтрокаТовары.КоличествоУпаковокНетто, СтрокаТовары.КоличествоУпаковокВыход);
			КонецЕсли;
			
			ТекКоэффициент = питОбщегоНазначения.ПолучитьКоэффициентУпаковки(СтрокаТовары.Номенклатура, СтрокаТовары.Упаковка);
			СтрокаТовары.КоличествоБрутто	= СтрокаТовары.КоличествоУпаковокБрутто * ТекКоэффициент;
			СтрокаТовары.КоличествоНетто	= СтрокаТовары.КоличествоУпаковокНетто * ТекКоэффициент;
			СтрокаТовары.КоличествоВыход	= СтрокаТовары.КоличествоУпаковокВыход * ТекКоэффициент;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет процент потерь холодной или горячей обработки по количествам.
//
// Параметры:
//  КоличествоИсх - исходное количество продукта до обработки.
//  КоличествоОбработанное - количество продукта после холодной или горячей обработки.
//
Функция РассчитатьПроцентПотерьОбработки(КоличествоИсх, КоличествоОбработанное)
	Если КоличествоИсх = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Окр((КоличествоИсх - КоличествоОбработанное) * 100 / КоличествоИсх, 2);
	КонецЕсли;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Получение актуальной рецептуры, отличной от данной, но с той же датой начала действия.
//
// Параметры:
//	НаДату - Дата, дата начала действия рецептуры
//
// Возвращаемое значение:
//	ДокументСсылка.питРецептура, найденная актуальная рецептура
//
Функция ПолучитьДругуюАктуальнуюРецептуру_2(Знач НаДату, Знач ШагДат=+1, Знач МаксимальнаяЗаДень=Ложь) Экспорт
	Результат = Новый Массив;
	// Если не указан ХозяйственнаяОперация, значит ничего не ищем
	Если НЕ ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда
		Возврат Результат;
	КонецЕсли;
	// Если НаДату не указана, то нечего искать
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос=Новый Запрос();
	
	// Сформируем текст запроса.
	// Первый запрос определяет, есть ли другая рецептура с той же датой.
	// Вложенный запрос собирает все рецептуры за этот день, чтобы потом определить максимальную дату.
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РецептурыЗаДень.Ссылка,
	|	РецептурыЗаДень.ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Документ.питРецептура КАК Рецептура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Рецептура.Ссылка КАК Ссылка,
	|			Рецептура.ДатаНачала КАК ДатаНачала
	|		ИЗ
	|			Документ.питРецептура КАК Рецептура
	|		ГДЕ
	|			Рецептура.Ссылка <> &Ссылка
	|			И Рецептура.Номенклатура = &Номенклатура
	|			И Рецептура.Характеристика = &Характеристика
	|			И НАЧАЛОПЕРИОДА(Рецептура.ДатаНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаОбъекта, ДЕНЬ)
	|			И Рецептура.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|			И (НЕ Рецептура.ПометкаУдаления)) КАК РецептурыЗаДень
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Рецептура.Ссылка <> &Ссылка
	|	И Рецептура.Номенклатура = &Номенклатура
	|	И Рецептура.Характеристика = &Характеристика
	|	И Рецептура.ДатаНачала = &ДатаОбъекта
	|	И Рецептура.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И (НЕ Рецептура.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала УБЫВ";
	
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);		
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",ХозяйственнаяОперация);
	Если НаДату <> Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаОбъекта", НаДату);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Возврат Результат;
		
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

// Получение актуальной рецептуры, отличной от данной, но с той же датой начала действия.
//
// Параметры:
//	НаДату - Дата, дата начала действия рецептуры
//
// Возвращаемое значение:
//	ДокументСсылка.питРецептура, найденная актуальная рецептура
//
Функция ПолучитьДругуюАктуальнуюРецептуру(Знач НаДату, Знач ШагДат=+1, Знач МаксимальнаяЗаДень=Ложь) Экспорт
	Результат = Новый Массив;
	// Если не указан ХозяйственнаяОперация, значит ничего не ищем
	Если НЕ ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда
		Возврат Результат;
	КонецЕсли;
	// Если НаДату не указана, то нечего искать
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос=Новый Запрос();
	
	// Сформируем текст запроса.
	// Первый запрос определяет, есть ли другая рецептура с той же датой.
	// Вложенный запрос собирает все рецептуры за этот день, чтобы потом определить максимальную дату.
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Рецептура.Ссылка,
	|	Рецептура.ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Документ.питРецептура КАК Рецептура
	|ГДЕ
	|	Рецептура.Ссылка <> &Ссылка
	|	И Рецептура.Номенклатура = &Номенклатура
	|	И Рецептура.Характеристика = &Характеристика
	|	И Рецептура.ДатаНачала = &ДатаОбъекта
	|	И Рецептура.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И (НЕ Рецептура.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала УБЫВ";
	
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);		
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",ХозяйственнаяОперация);
	Если НаДату <> Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаОбъекта", НаДату);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Возврат Результат;
		
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ
//

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированныйУчетПодсистемы") Тогда
		МодульЗаполнениеДокументов = ОбщегоНазначения.ОбщийМодуль("ЗаполнениеДокументов");
		МодульЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) И НЕ ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда
		
		ДоступныеВидыРецептур = питОбщегоНазначенияКлиентСервер.ПолучитьДоступныеВидыРецептур(Номенклатура);
		Если ДоступныеВидыРецептур.Количество() Тогда
			// Берем 1е доступное значение(это будет значение по умолчанию).
			ХозяйственнаяОперация = ДоступныеВидыРецептур[0];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка 
		ИЛИ (ДополнительныеСвойства.Свойство("Загрузка") 
		И ДополнительныеСвойства.Загрузка) Тогда
		Возврат;
	КонецЕсли;
	
	//+АвтовыборНоменклатуры
	ПредставленияНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Ингредиенты.ВыгрузитьКолонку("Номенклатура"), "Представление");
	ПредставленияХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Ингредиенты.ВыгрузитьКолонку("Характеристика"), "Представление");
	Для каждого ТекИнгредиент Из Ингредиенты Цикл
		ТекИнгредиент.НоменклатураПредставление = ?(ПустаяСтрока(ТекИнгредиент.НоменклатураСтрокой), ПредставленияНоменклатуры.Получить(ТекИнгредиент.Номенклатура), ТекИнгредиент.НоменклатураСтрокой);
		ТекИнгредиент.ХарактеристикаПредставление = ?(ПустаяСтрока(ТекИнгредиент.ХарактеристикаСтрокой), ПредставленияНоменклатуры.Получить(ТекИнгредиент.Характеристика), ТекИнгредиент.ХарактеристикаСтрокой);
	КонецЦикла;
	//-АвтовыборНоменклатуры
	
	Отказ = НЕ Документы.питРецептура.ПроверитьНаДубли(ЭтотОбъект);
	
	Заголовок = "Сохранение документа: " + СокрЛП(ЭтотОбъект)+"";
	
	//+ПараметрищацияРецептур
	Если ХозяйственнаяОперация = Перечисления.питХозяйственныеОперации.РецептураРазделка Тогда
		Для каждого ТекИнгредиент Из Ингредиенты Цикл
			ТекИнгредиент.АлгоритмРасчетаКоличества = "";
		КонецЦикла;
		ОтборПоСвойствам.Очистить();
	КонецЕсли;
	//-ПараметризацияРецептур
	
	// Режим - актуальные рецептуры
	//Если Константы.питСпособРасчетаРецептур.Получить() = Перечисления.питСпособРасчетаРецептур.ПоАктуальнойРецептуре Тогда
	Если питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("СпособРасчетаРецептур") = Перечисления.питСпособРасчетаРецептур.ПоАктуальнойРецептуре Тогда
		Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
			ДатаНачала = Дата;
		КонецЕсли;
		// Проверим, а не программно ли записывается документ: в этом случае с него могла быть снята пометка удаления.
		// Тогда при совпадении дат начала действия переведем дату.
		//ФормаДокумента = ПолучитьФорму("ФормаДокумента");
		//ЗаписьПрограммно = НЕ ФормаДокумента.Открыта();
		//Если ЗаписьПрограммно Тогда
		//	НоваяДатаНачала = ПолучитьДругуюАктуальнуюРецептуру(ДатаНачала);
		//	Если ЗначениеЗаполнено(НоваяДатаНачала) Тогда
		//		// Эта дата занята, изменим дату начала действия
		//		ДатаНачала = НоваяДатаНачала;
		//	КонецЕсли;
		//КонецЕсли;
		
		// Проверка корректности заполнения периода действия
		Если ЗначениеЗаполнено(ДатаКонца) И ДатаНачала > ДатаКонца Тогда
			ТекстСообщения = "Дата начала периода действия рецептуры <" + Формат(ДатаНачала, "ДЛФ=DT") + "> превышает дату окончания <" + Формат(ДатаКонца, "ДЛФ=DT")+">";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДатаКонца", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	// Нужно очистить невидимые разряды в количествах,
	// только для специй допустимо указывать более трех разрядов в количествах.
	Для Каждого СтрокаТовара Из Ингредиенты Цикл
		//<< Портал-Юг, Гребенюк, 2023.05.12 [Обновление 2.5. Код без комментариев]
		Если СтрокаТовара.Специя Тогда
			Продолжить;
		КонецЕсли;		
		//>> Портал-Юг, Гребенюк, 2023.05.12
		Если НЕ СтрокаТовара.КоличествоУпаковокБрутто = Окр(СтрокаТовара.КоличествоУпаковокБрутто,3) Тогда
			СтрокаТовара.КоличествоУпаковокБрутто = Окр(СтрокаТовара.КоличествоУпаковокБрутто,3);
		КонецЕсли;
		Если НЕ СтрокаТовара.КоличествоУпаковокНетто = Окр(СтрокаТовара.КоличествоУпаковокНетто,3) Тогда
			СтрокаТовара.КоличествоУпаковокНетто = Окр(СтрокаТовара.КоличествоУпаковокНетто,3);
		КонецЕсли;
		Если НЕ СтрокаТовара.КоличествоУпаковокВыход = Окр(СтрокаТовара.КоличествоУпаковокВыход,3) Тогда
			СтрокаТовара.КоличествоУпаковокВыход = Окр(СтрокаТовара.КоличествоУпаковокВыход,3);
		КонецЕсли;
	КонецЦикла;
	
	//+РазрешенныеПодразделения
	НайденныеПодразделения = ЭтотОбъект.РазрешенныеПодразделения.НайтиСтроки(Новый Структура("Подразделение", ЭтотОбъект.Подразделение));
	КоличествоНайденных = НайденныеПодразделения.Количество();
	Если КоличествоНайденных И НЕ ЗначениеЗаполнено(ЭтотОбъект.ЦеховаяКладовая) Тогда
		// Нашли в ТЧ строки, соответствующие подразделению из шапки и при этом в шапке не указан цех.
		
		// Ищем среди найденных строк строку с пустым цехом.
		ПустыхСтрокНайдено = 0;
		СтрокиУдалить = Новый Массив;
		Для каждого НайденноеПодразделение Из НайденныеПодразделения Цикл
			Если НЕ ЗначениеЗаполнено(НайденноеПодразделение.ЦеховаяКладовая) Тогда
				СтрокиУдалить.Добавить(НайденноеПодразделение);
				ПустыхСтрокНайдено = ПустыхСтрокНайдено + 1;
			КонецЕсли;
		КонецЦикла;
		// Если строки кроме пустых строк еще что-то есть, то удаляем пустые строки.
		Если КоличествоНайденных - ПустыхСтрокНайдено Тогда
			Для каждого ТекСтрокаУдалить Из СтрокиУдалить Цикл
				РазрешенныеПодразделения.Удалить(ТекСтрокаУдалить);
				КоличествоНайденных = КоличествоНайденных - 1;
			КонецЦикла;
		КонецЕсли;
		
		ПодразделениеЦехНайдено = Истина;
		
	Иначе
		ПодразделениеЦехНайдено = Ложь;
		Для каждого ТекНайденноеПодразделение Из НайденныеПодразделения Цикл
			Если ТекНайденноеПодразделение.ЦеховаяКладовая = Справочники.Склады.ПустаяСсылка() 
				ИЛИ ТекНайденноеПодразделение.ЦеховаяКладовая = ЭтотОбъект.ЦеховаяКладовая Тогда
				ПодразделениеЦехНайдено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НЕ ПодразделениеЦехНайдено Тогда
		НовПодразделение = ЭтотОбъект.РазрешенныеПодразделения.Добавить();
		НовПодразделение.Подразделение		= ЭтотОбъект.Подразделение;
		НовПодразделение.ЦеховаяКладовая	= ЭтотОбъект.ЦеховаяКладовая;
		НовПодразделение.ВключаяПодчиненные	= Истина;
	КонецЕсли;
	//-РазрешенныеПодразделения
	
	ДополнительныеСвойства.Вставить("ЭтоПометкаУдаления", ПометкаУдаления = Истина);
	
	// Заполнение наименования рецептуры.
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Наименование = Документы.питРецептура.СформироватьНаименованиеРецептуры(Номенклатура, Характеристика, ДатаНачала, ДатаКонца);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "";
	
	// Удалим существующие записи по рецептуре.
	Отказ = НЕ РегистрыСведений.питАктуальныеРецептуры.УдалитьЗаписиПоРецептуре(Ссылка, ТекстСообщения);
	
	Если НЕ Отказ И НЕ ДополнительныеСвойства.ЭтоПометкаУдаления Тогда
		
		ТекПодразделения = питПроизводство.НайтиПодразделенияПоРазрешенным(РазрешенныеПодразделения.Выгрузить());
		
		Для каждого ТекПодразделение Из ТекПодразделения Цикл
			
			МенеджерДобавить = РегистрыСведений.питАктуальныеРецептуры.СоздатьМенеджерЗаписи();
			МенеджерДобавить.Период					= ДатаНачала;
			МенеджерДобавить.Номенклатура			= Номенклатура;
			МенеджерДобавить.Характеристика			= Характеристика;
			МенеджерДобавить.Организация			= Организация;
			МенеджерДобавить.Подразделение			= ТекПодразделение;
			МенеджерДобавить.Рецептура				= Ссылка;
			МенеджерДобавить.ДатаОкончания			= ДатаКонца;
			
			Попытка
				МенеджерДобавить.Записать(Ложь);
			Исключение
				Отказ = Истина;
				ТекстСообщения = ТекстСообщения + "
				|Не удалось записать рецептуру с параметрами:
				| - Дата начала:	<"+ДатаНачала+">
				| - Номенклатура:	<"+Номенклатура+">
				| - Характеристика:	<"+Характеристика+">
				| - Организация:	<"+Организация+"> 
				| - Подразделение:	<"+ТекПодразделение+">!
				|"+ОписаниеОшибки();
				Прервать;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	//+debug
	МассивНепроверяемыхРеквизитов.Добавить("Ингредиенты.КоличествоУпаковокБрутто");
	//-debug
	
	#Область ПроверкаХарактеристик
	
	// Проверка заполнения характеристик в шапке.
	Если НЕ питОбщегоНазначения.ХарактеристикиИспользуются(Номенклатура) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Характеристика");
	КонецЕсли;
	
	ПараметрыПроверкиХарактеристик = НоменклатураСервер.ПараметрыПроверкиЗаполненияХарактеристик();
	
	//ПараметрыПроверкиХарактеристик.ИмяТЧ = "Ингредиенты";
	//НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверкиХарактеристик);
	//ПараметрыПроверкиХарактеристик.СуффиксДопРеквизита = "Замены";
	//НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверкиХарактеристик);
	//ПараметрыПроверкиХарактеристик.СуффиксДопРеквизита = "";
	
	МассивНепроверяемыхРеквизитов.Добавить("Ингредиенты.Характеристика");
	МассивНепроверяемыхРеквизитов.Добавить("Ингредиенты.ХарактеристикаЗамены");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"
		|ВЫБРАТЬ 
		|	ТЧИнгредиенты.НомерСтроки,
		|	ТЧИнгредиенты.Номенклатура, 
		|	ТЧИнгредиенты.Характеристика, 
		|	ТЧИнгредиенты.Замена,
		|	ТЧИнгредиенты.ХарактеристикаЗамены,
		|	ТЧИнгредиенты.СпособАвтовыбораХарактеристики
		|ПОМЕСТИТЬ ВТИнгредиенты 
		|ИЗ &ТЧИнгредиенты КАК ТЧИнгредиенты;
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ НоменклатураСпр.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|				И питРецептураИнгредиенты.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|				И питРецептураИнгредиенты.СпособАвтовыбораХарактеристики = ЗНАЧЕНИЕ(Перечисление.СпособыАвтовыбораХарактеристики.УказываетсяВНСИ)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ХарактеристикаЗаполнена,
		|	питРецептураИнгредиенты.НомерСтроки,
		|	ВЫБОР
		|		КОГДА НЕ Замены.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|				И питРецептураИнгредиенты.ХарактеристикаЗамены = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ХарактеристикаЗаменыЗаполнена
		|ИЗ
		|	ВТИнгредиенты КАК питРецептураИнгредиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО питРецептураИнгредиенты.Номенклатура = НоменклатураСпр.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Замены
		|		ПО питРецептураИнгредиенты.Замена = Замены.Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЧИнгредиенты", ЭтотОбъект.Ингредиенты.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(ЭтотОбъект);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ВыборкаДетальныеЗаписи.ХарактеристикаЗаполнена Тогда
			Отказ = Истина;
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Ингредиенты", ВыборкаДетальныеЗаписи.НомерСтроки, "Характеристика");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена характеристика ингредиента в строке "+ВыборкаДетальныеЗаписи.НомерСтроки+" таблицы ""Ингредиенты""!",,,,Отказ);
		КонецЕсли;
		Если НЕ ВыборкаДетальныеЗаписи.ХарактеристикаЗаменыЗаполнена Тогда
			Отказ = Истина;
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Ингредиенты", ВыборкаДетальныеЗаписи.НомерСтроки, "ХарактеристикаЗамены");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена характеристика замены в строке "+ВыборкаДетальныеЗаписи.НомерСтроки+" таблицы ""Ингредиенты""!",,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПроверкиХарактеристик.ИмяТЧ = "ПобочныеИзделия";
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверкиХарактеристик);
	
	#КонецОбласти
	
	//+АвтовыборНоменклатуры
	МассивНепроверяемыхРеквизитов.Добавить("Ингредиенты.Номенклатура");
	ПроверитьЗаполнениеНоменклатурыИнгредиентов(
		МассивНепроверяемыхРеквизитов,
		Отказ);
	//+АвтовыборНоменклатуры
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

//+АвтовыборНоменклатуры
Процедура ПроверитьЗаполнениеНоменклатурыИнгредиентов(МассивНепроверяемыхРеквизитов, Отказ)
	
	ИмяТЧ           = "Ингредиенты";
	ПредставлениеТЧ = "Ингредиенты";
	
	ИспользуетсяПроизводство22 = ПроизводствоСервер.ИспользуетсяПроизводство22();
	ТипыНоменклатуры           = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Ингредиенты.ВыгрузитьКолонку("Номенклатура"), "ТипНоменклатуры");
	
	Для каждого Строка Из Ингредиенты Цикл
		
		Если Строка.Номенклатура.Пустая()
			И (Строка.СпособАвтовыбораНоменклатуры = Перечисления.СпособыАвтовыбораНоменклатуры.УказываетсяВНСИ
			
			//ИЛИ Строка.СпособАвтовыбораНоменклатуры = Перечисления.СпособыАвтовыбораНоменклатуры.ЗадаетсяВСвойствеПродукции
			//	И Строка.ПроизводитсяВПроцессе
			//	И Строка.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе
			//
			//ИЛИ Строка.СпособАвтовыбораНоменклатуры = Перечисления.СпособыАвтовыбораНоменклатуры.УточняетсяПриПроизводстве
			//	И Строка.ПроизводитсяВПроцессе
				
			ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПараметризациюРесурсныхСпецификаций")
			) Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение", НСтр("ru = 'Номенклатура';
																												|en = 'Products and services'"), Строка.НомерСтроки, ПредставлениеТЧ);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ, Строка.НомерСтроки, "Номенклатура");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				Поле,,
				Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//-АвтовыборНоменклатуры
